# ШАГ 1: БАЗОВЫЙ ОБРАЗ
# Берем официальный образ Python 3.10, предназначенный для маленьких контейнеров (slim)
FROM python:3.10-slim

# ШАГ 2: УСТАНОВКА
# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# ШАГ 3: КОПИРОВАНИЕ ЗАВИСИМОСТЕЙ
# Копируем файл зависимостей в контейнер
COPY requirements.txt .

# ШАГ 4: УСТАНОВКА ЗАВИСИМОСТЕЙ
# Устанавливаем все библиотеки (FastAPI, uvicorn, scikit-learn, joblib)
RUN pip install --no-cache-dir -r requirements.txt

# ШАГ 5: КОПИРОВАНИЕ КОДА И МОДЕЛИ
# Копируем весь твой код, модель и scaler в рабочую директорию /app
# Вся твоя папка проекта копируется в контейнер
COPY . .

# ШАГ 6: ПОРТ
# Сообщаем Docker, что приложение слушает порт 8000
EXPOSE 8000

# ШАГ 7: КОМАНДА ЗАПУСКА
# Это команда, которая будет выполняться при старте контейнера
# - -host 0.0.0.0 нужен, чтобы сервер был доступен извне контейнера
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]