# Берем официальный образ Python 3.10, предназначенный для маленьких контейнеров (slim)
FROM python:3.10-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл зависимостей в контейнер
COPY requirements.txt .

# Устанавливаем все нужные библиотеки
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь код, модель и scaler в рабочую директорию /app
COPY . .

# Сообщаем Docker, что приложение слушает порт 8000
EXPOSE 8000

# Это команда, которая будет выполняться при старте контейнера
# --host 0.0.0.0 нужен, чтобы сервер был доступен извне контейнера
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]